package CollectionsLessons;

public class Big_O_Notation {
    // O(1), O(n)....O(logn)
    //Big O нотация нужна для описания сложности алгоритмов. Для этого используется понятие времени.
    // O(1) алгоритм выполняется за постоянное (константное) время - является самым эффективным
    // например когда за одинаковое время мы можем получить и 5 элемент массива и 9999 элемент массива
    //
    //O(n) линейный алгоритм (чем больше элементов в массиве тем больше операций)(количество операций пропорционально возрастает количеству элементов)
    // например когда нужно сложить все элементы массива из 3 элементов это займет две опервации
    // а для того чтобы сложить элементы массива из 100 элементов понадобится 99 операций
    //
    //O(logn) по скорости хуже чем О(1) но лучше чем O(n) как пример бинарный поиск


}
